In [1]:
import pandas as pd     
import numpy as np         
import seaborn as sns                
import matplotlib.pyplot as plt

In [4]:
df = pd.read_csv('penguins.csv')
df.head()
df.columns.to_list

<bound method IndexOpsMixin.tolist of Index(['species', 'island', 'bill_length_mm', 'bill_depth_mm',
       'flipper_length_mm', 'body_mass_g', 'sex'],
      dtype='object')>

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 344 entries, 0 to 343
Data columns (total 7 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   species            344 non-null    object
 1   island             344 non-null    object
 2   bill_length_mm     342 non-null    float64
 3   bill_depth_mm      342 non-null    float64
 4   flipper_length_mm  342 non-null    float64
 5   body_mass_g        342 non-null    float64
 6   sex                333 non-null    object
dtypes: float64(4), object(3)
memory usage: 18.9+ KB

In [6]:
df.isna().sum()

species               0
island                0
bill_length_mm        2
bill_depth_mm         2
flipper_length_mm     2
body_mass_g           2
sex                  11
dtype: int64

In [10]:
# drop na
df_drop = df.dropna(subset='sex')
df_drop.isna().sum()
df_drop.shape

(333, 7)

In [14]:
xdata = df_drop[df_drop['species'].isin(['Agentoo', 'Adelie'])]
xdata.head()

,species,island,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,sex
0,Adelie,Torgersen,39.1,18.7,181.0,3750.0,MALE
1,Adelie,Torgersen,39.5,17.4,186.0,3800.0,FEMALE
2,Adelie,Torgersen,40.3,18.0,195.0,3250.0,FEMALE
4,Adelie,Torgersen,36.7,19.3,193.0,3450.0,FEMALE
5,Adelie,Torgersen,39.3,20.6,190.0,3650.0,MALE

In [18]:
xwhere = df_drop.where(df_drop['bill_depth_mm'] > 20)
xwhere.head()

,species,island,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,sex
0,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,NaN,NaN,NaN,NaN,NaN,NaN,NaN
5,Adelie,Torgersen,39.3,20.6,190.0,3650.0,MALE

In [22]:
ywhere = np.where(df_drop['bill_depth_mm']>20, df_drop['bill_depth_mm']*0.5, df_drop['bill_depth_mm'] )
print(ywhere)

[18.7  17.4  18.   19.3  10.3  17.8  19.6  17.6  10.6  10.55 17.8  19.
 10.35 18.4  10.75 18.3  18.7  19.2  18.1  17.2  18.9  18.6  17.9  18.6
 18.9  16.7  18.1  17.8  18.9  17.   10.55 20.   18.5  19.3  19.1  18.
 18.4  18.5  19.7  16.9  18.8  19.   17.9  10.6  17.7  18.9  17.9  19.5
 18.1  18.6  17.5  18.8  16.6  19.1  16.9  10.55 17.   18.2  17.1  18.
 16.2  19.1  16.6  19.4  19.   18.4  17.2  18.9  17.5  18.5  16.8  19.4
 16.1  19.1  17.2  17.6  18.8  19.4  17.8  10.15 19.5  18.6  19.2  18.8
 18.   18.1  17.1  18.1  17.3  18.9  18.6  18.5  16.1  18.5  17.9  20.
 16.   20.   18.6  18.9  17.2  20.   17.   19.   16.5  10.15 17.7  19.5
 10.35 18.3  17.   10.25 17.   18.6  17.2  19.8  17.   18.5  15.9  19.
 17.6  18.3  17.1  18.   17.9  19.2  18.5  18.5  17.6  17.5  17.5  10.05
 16.5  17.9  17.1  17.2  15.5  17.   16.8  18.7  18.6  18.4  17.8  18.1
 17.1  18.5  17.9  19.5  19.2  18.7  19.8  17.8  18.2  18.2  18.9  19.9
 17.8  10.15 17.3  18.1  17.1  19.6  20.   17.8  18.6  18.2  17.3  17.5
 16.6  19.4  17.9  19.   18.4  19.   17.8  20.   16.6  10.4  16.7  18.8
 18.6  16.8  18.3  10.35 16.6  19.9  19.5  17.5  19.1  17.   17.9  18.5
 17.9  19.6  18.7  17.3  16.4  19.   17.3  19.7  17.3  18.8  16.6  19.9
 18.8  19.4  19.5  16.5  17.   19.8  18.1  18.2  19.   18.7  13.2  16.3
 14.1  15.2  14.5  13.5  14.6  15.3  13.4  15.4  13.7  16.1  13.7  14.6
 14.6  15.7  13.5  15.2  14.5  15.1  14.3  14.5  14.5  15.8  13.1  15.1
 15.   14.3  15.3  15.3  14.2  14.5  17.   14.8  16.3  13.7  17.3  13.6
 15.7  13.7  16.   13.7  15.   15.9  13.9  13.9  15.9  13.3  15.8  14.2
 14.1  14.4  15.   14.4  15.4  13.9  15.   14.5  15.3  13.8  14.9  13.9
 15.7  14.2  16.8  16.2  14.2  15.   15.   15.6  15.6  14.8  15.   16.
 14.2  16.3  13.8  16.4  14.5  15.6  14.6  15.9  13.8  17.3  14.4  14.2
 14.   17.   15.   17.1  14.5  16.1  14.7  15.7  15.8  14.6  14.4  16.5
 15.   17.   15.5  15.   16.1  14.7  15.8  14.   15.1  15.2  15.9  15.2
 16.3  14.1  16.   16.2  13.7  14.3  15.7  14.8  16.1 ]